import os
import time
labirint = [[2,1,0,1,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2],
[2,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2],
[2,1,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,2],
[2,1,0,1,0,1,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1,2],
[2,1,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,2],
[2,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,0,1,2],
[2,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,1,2],
[2,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,0,1,2],
[2,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,2],
[2,1,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2],
[2,1,1,1,1,1,0,1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,2],
[2,1,0,0,0,0,0,1,0,1,0,1,0,0,0,0,0,1,0,1,0,1,0,0,0,1,2],
[2,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,0,1,1,1,0,1,2],
[2,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,1,2],
[2,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1,2],
[2,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,2],
[2,1,0,1,1,1,1,1,1,1,1,1,1,0,1,0,0,1,1,1,0,1,1,1,1,1,1],
[2,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0],
[2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
[2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2]]

def maze():
    time.sleep(0.009)
    os.system('cls')
    print()
    for i in range(20):
        for j in range(27):
            if labirint[i][j] == 2:
                print('░', end = '')
            elif labirint[i][j] == 1:
                print('█', end = '')
            elif labirint[i][j] == 0:
                print(' ',end = '')
            elif labirint[i][j] == 8:
                print(' ', end = '')
            elif labirint[i][j] == 5:
                print('Q', end = '')
        print()
   

labirint[0][2] = 5
x = 2
y = 0 # Координаты чела: 5 - сам чел
n = 1 # Направление
count = 0

while y != 18 and x != 26: 
        maze()
        
        if n == 1: #down
            if labirint[y][x-1] == 0:
                n = 4
            elif labirint[y+1][x] == 0:
                n = 1
            elif labirint[y][x+1] == 0:
                n = 2
            else:
                n = 3
                
        elif n == 2: #right
            if labirint[y+1][x] == 0:
                n = 1
            elif labirint[y][x+1] == 0:
                n = 2
            elif labirint[y-1][x] == 0:
                n = 3
            else:
                n = 4
            
        elif n == 3: #up
            if labirint[y][x+1] == 0:
                n = 2
            elif labirint[y-1][x] == 0:
                n = 3
            elif labirint[y][x-1] == 0:
                n = 4
            else:
                n = 1
                     
        elif n == 4: #left
            if labirint[y-1][x] == 0:
                n = 3
            elif labirint[y][x-1] == 0:
                n = 4
            elif labirint[y+1][x] == 0:
                n = 1
            else:
                n = 2
                
        if n == 1:
            y += 1
            labirint[y-1][x] = 0
            count += 1
            print('Количество шагов = ' +str(count))
        elif n == 2:
            x += 1
            labirint[y][x-1] = 0
            count += 1
            print('Количество шагов = ' +str(count))
        elif n == 3:
            y -= 1
            labirint[y+1][x] = 0
            count += 1
            print('Количество шагов = ' +str(count))
        elif n == 4:
            x -= 1
            labirint[y][x+1] = 0
            count += 1
            print('Количество шагов = ' +str(count))
            
        labirint[y][x] = 5
           
print('You win')
a = input()

